## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                 |
|--------|---------------------------------------------------------------------|
| add    | `module.weblate.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]` |
| update | `module.weblate.aws_rds_cluster.cluster`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.weblate.aws_cloudwatch_log_group.log_exports["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "log_exports" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/cluster/weblate-staging-cluster/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-cluster"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "platform-core-services"
          + "Name"       = "weblate-staging-cluster"
          + "Terraform"  = "true"
        }
    }

  # module.weblate.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ copy_tags_to_snapshot               = false -> true
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
        id                                  = "weblate-staging-cluster"
        tags                                = {
            "CostCentre" = "platform-core-services"
            "Name"       = "weblate-staging-cluster"
            "Terraform"  = "true"
        }
        # (39 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
